"""
Цей модуль містить функції для обчислення визначеного інтегралу
функції f(x) = x^2. Використовуємо бібліотеку SciPy для
обчислення аналітичного інтегралу.
"""

import scipy.integrate as spi

def f(x: float) -> float:
    """
    Обчислює значення функції f(x) = x^2.

    :param x: Значення, для якого потрібно обчислити функцію.
    :return: Значення функції f(x).
    """
    return x ** 2

def calculate_analytic_integral(a: float, b: float) -> tuple:
    """
    Обчислює аналітичний інтеграл функції f(x) від a до b.

    :param a: Початкова межа інтегрування.
    :param b: Кінцева межа інтегрування.
    :return: Кортеж, що містить значення інтегралу та оцінку похибки.
    """
    # Виконання чисельного інтегрування за допомогою методу quad
    result, error = spi.quad(f, a, b)
    return result, error
